In [1]:
from sqlalchemy import create_engine
import pandas as pd

engine = create_engine('postgresql://postgres:1234@localhost/HRPortfolio')

In [2]:
df = pd.read_csv('Human Resources.csv')
df.head()

,id,first_name,last_name,birthdate,gender,race,department,jobtitle,location,hire_date,termdate,location_city,location_state
0,00-0037846,Kimmy,Walczynski,06-04-91,Male,Hispanic or Latino,Engineering,Programmer Analyst I,Headquarters,1/20/2002,NaN,Cleveland,Ohio
1,00-0041533,Ignatius,Springett,6/29/1984,Male,White,Business Development,Business Analyst,Headquarters,04-08-19,NaN,Cleveland,Ohio
2,00-0045747,Corbie,Bittlestone,7/29/1989,Male,Black or African American,Sales,Solutions Engineer Manager,Headquarters,10-12-10,NaN,Cleveland,Ohio
3,00-0055274,Baxy,Matton,9/14/1982,Female,White,Services,Service Tech,Headquarters,04-10-05,NaN,Cleveland,Ohio
4,00-0076100,Terrell,Suff,04-11-94,Female,Two or More Races,Product Management,Business Analyst,Remote,9/29/2010,2029-10-29 06:09:38 UTC,Flint,Michigan

In [3]:
df.shape

(22214, 13)

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 22214 entries, 0 to 22213
Data columns (total 13 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   id              22214 non-null  object
 1   first_name      22214 non-null  object
 2   last_name       22214 non-null  object
 3   birthdate       22214 non-null  object
 4   gender          22214 non-null  object
 5   race            22214 non-null  object
 6   department      22214 non-null  object
 7   jobtitle        22214 non-null  object
 8   location        22214 non-null  object
 9   hire_date       22214 non-null  object
 10  termdate        3929 non-null   object
 11  location_city   22214 non-null  object
 12  location_state  22214 non-null  object
dtypes: object(13)
memory usage: 2.2+ MB

In [11]:
df['birthdate']

0         06-04-91
1        6/29/1984
2        7/29/1989
3        9/14/1982
4         04-11-94
           ...
22209     07-08-98
22210    4/19/2001
22211     02-09-70
22212     09-02-85
22213     07-10-99
Name: birthdate, Length: 22214, dtype: object

In [15]:
df["birthdate"] = pd.to_datetime(df["birthdate"])
df["hire_date"] = pd.to_datetime(df["hire_date"])
df[['birthdate','hire_date']]

       birthdate  hire_date
0     1991-06-04 2002-01-20
1     1984-06-29 2019-04-08
2     1989-07-29 2010-10-12
3     1982-09-14 2005-04-10
4     1994-04-11 2010-09-29
...          ...        ...
22209 1998-07-08 2012-02-08
22210 2001-04-19 2017-10-06
22211 2070-02-09 2001-02-08
22212 1985-09-02 2005-04-03
22213 1999-07-10 2018-03-27

[22214 rows x 2 columns]

In [16]:
df.to_sql('hrproject', engine, if_exists='replace')

214